
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>提升效率的技巧 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="08.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.3" data-path="03.html">
            
                <a href="03.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.4" data-path="04.html">
            
                <a href="04.html">
            
                    
                    生成器模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.5" data-path="05.html">
            
                <a href="05.html">
            
                    
                    工厂方法模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.6" data-path="06.html">
            
                <a href="06.html">
            
                    
                    原型模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.7" data-path="07.html">
            
                <a href="07.html">
            
                    
                    建造者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.8" data-path="08.html">
            
                <a href="08.html">
            
                    
                    常见十种设计模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="99.html">
            
                <a href="99.html">
            
                    
                    提升效率的技巧
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    问题记录
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="09.html">
            
                <a href="09.html">
            
                    
                    webview问题1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="10.html">
            
                <a href="10.html">
            
                    
                    git路径问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    Can not perform this action after onSaveInstanceState
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    新发现
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="11.html">
            
                <a href="11.html">
            
                    
                    python的getopt
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="12.html">
            
                <a href="12.html">
            
                    
                    python的ConfigParser
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    技能
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="13.html">
            
                <a href="13.html">
            
                    
                    activity栈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="git_blog.html">
            
                <a href="git_blog.html">
            
                    
                    github-gitbook-github流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="view.html">
            
                <a href="view.html">
            
                    
                    view相关心得
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="volitile.html">
            
                <a href="volitile.html">
            
                    
                    volitile
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >提升效率的技巧</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x63D0;&#x5347;&#x6548;&#x7387;&#x7684;&#x6280;&#x5DE7;">&#x63D0;&#x5347;&#x6548;&#x7387;&#x7684;&#x6280;&#x5DE7;</h1>
<p>&#x4ECE;&#x4E8B;&#x5F00;&#x53D1;&#x4EE5;&#x6765;&#x5DF2;&#x7ECF;&#x6709;&#x4E09;&#x5E74;&#x534A;&#x7684;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x4E00;&#x8DEF;&#x8D70;&#x6765;&#x81EA;&#x5DF1;&#x6210;&#x957F;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x8FDC;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x4E09;&#x5E74;&#x534A;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x8BE5;&#x6709;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x5BA1;&#x89C6;&#x81EA;&#x5DF1;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x53D1;&#x73B0;&#x81EA;&#x8EAB;&#x7684;&#x4E0D;&#x8DB3;&#x548C;&#x7F3A;&#x9677;&#xFF0C;&#x7F3A;&#x4E4F;&#x6DF1;&#x5165;&#x601D;&#x8003;&#x548C;&#x5B66;&#x4E60;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x903B;&#x8F91;&#x6DF7;&#x4E71;&#xFF0C;&#x8BB0;&#x5FC6;&#x529B;&#x5DEE;&#xFF0C;&#x4E0D;&#x4E60;&#x60EF;&#x603B;&#x7ED3;&#x3002;&#x5E0C;&#x671B;2018&#x80FD;&#x591F;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x8EAB;&#x7684;&#x52AA;&#x529B;&#x548C;&#x63D0;&#x9AD8;&#xFF0C;&#x8DDD;&#x79BB;&#x4E09;&#x5341;&#x5C81;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x9053;&#x574E;&#xFF0C;&#x8DE8;&#x8FC7;&#x53BB;&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x548C;&#x5BB6;&#x5EAD;&#x6709;&#x91CD;&#x8981;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x52AA;&#x529B;&#x524D;&#x884C;&#x3002;</p>
<h4 id="&#x539F;&#x6587;&#x51FA;&#x5904;"><a href="http://blog.csdn.net/olsQ93038o99S/article/details/78945127" target="_blank">&#x539F;&#x6587;&#x51FA;&#x5904;</a></h4>
<p>&#x4E5F;&#x8BB8;&#x6709;&#x4EBA;&#x4F1A;&#x89C9;&#x5F97;&#x8FD9;&#x79CD;&#x5B9A;&#x4E49;&#x592A;&#x8FC7;&#x72ED;&#x9698;&#xFF0C;&#x6CA1;&#x9519;&#xFF0C;&#x786E;&#x5B9E;&#x72ED;&#x9698;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5904;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x9636;&#x6BB5;&#xFF0C;&#x6709;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x751F;&#x8FFD;&#x6C42;&#x548C;&#x751F;&#x6D3B;&#x8BC9;&#x6C42;&#xFF0C;&#x6211;&#x8C28;&#x4EE5;&#x6B64;&#x6587;&#x8BA9;&#x5927;&#x5BB6;&#x6362;&#x4E2A;&#x89D2;&#x5EA6;&#x53BB;&#x5BA1;&#x89C6;&#x8FD9;&#x4E2A;&#x804C;&#x4E1A;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x4F1A;&#x6709;&#x4E9B;&#x611F;&#x89E6;&#x548C;&#x542F;&#x53D1;&#x3002;</p>
<h3 id="keep-you-sane">Keep You Sane</h3>
<p>&#x4FDD;&#x6301;&#x6E05;&#x9192;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x80FD;&#x505A;&#x5230;&#x5DE5;&#x4F5C;&#x548C;&#x751F;&#x6D3B;&#x7684;&#x5E73;&#x8861;&#xFF0C;&#x6709;&#x66F4;&#x591A;&#x7684;&#x7CBE;&#x529B;&#x53BB;&#x505A;&#x81EA;&#x5DF1;&#x7231;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x966A;&#x81EA;&#x5DF1;&#x7231;&#x7684;&#x4EBA;&#x3002;&#x8FD9;&#x662F;&#x672C;&#x6587;&#x7684;&#x6700;&#x7EC8;&#x76EE;&#x7684;&#x3002;</p>
<h3 id="&#x5584;&#x7528;&#x5DE5;&#x5177;">&#x5584;&#x7528;&#x5DE5;&#x5177;</h3>
<p>&#x4E1A;&#x754C;&#x6709;&#x53E5;&#x8BDD;&#x53EB;&#x505A;&#x201C;&#x4E0D;&#x8981;&#x91CD;&#x590D;&#x9020;&#x8F6E;&#x5B50;&#x201D;&#xFF0C;&#x4EBA;&#x7C7B;&#x5C31;&#x50CF;&#x4E00;&#x53F0;&#x5185;&#x5B58;&#x6709;&#x9650;&#x3001;CPU&#x6709;&#x9650;&#x3001;&#x786C;&#x76D8;&#x6709;&#x9650;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x65E2;&#x7136;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x8C03;&#x7528;API&#xFF0C;&#x5C31;&#x4E0D;&#x8981;&#x8BD5;&#x56FE;&#x5728;&#x672C;&#x5730;&#x8DD1;&#x5404;&#x79CD;&#x670D;&#x52A1;&#xFF0C;&#x90A3;&#x6837;&#x53EA;&#x4F1A;&#x8BA9;&#x81EA;&#x5DF1;&#x53D8;&#x5F97;&#x81C3;&#x80BF;&#x3001;&#x8026;&#x5408;&#x3001;&#x6EE1;&#x8D1F;&#x8377;&#x3002;
&#x50CF;Beyond Compare(&#x4EE3;&#x7801;&#x6BD4;&#x8F83;&#x5408;&#x5E76;), Notepad ++&#xFF08;&#x5173;&#x95ED;&#x65F6;&#x65E0;&#x9700;&#x4FDD;&#x5B58;&#xFF09;, Chrome&#xFF08;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#xFF09;, VPN&#xFF08;google&#x5FC5;&#x5907;&#xFF09;, FastStone Capture&#xFF08;&#x622A;&#x5C4F;&#x3001;&#x6D4B;&#x91CF;&#x3001;&#x5F55;&#x5C4F;&#x3001;&#x53D6;&#x8272;&#x7B49;&#xFF09;&#x3001;Chrome &#x7FFB;&#x8BD1;&#x63D2;&#x4EF6;&#xFF08;&#x5FEB;&#x901F;&#x7FFB;&#x8BD1;&#x7F51;&#x9875;&#x82F1;&#x6587;&#xFF09;&#x3001;&#x53CD;&#x7F16;&#x8BD1;&#x5DE5;&#x5177;&#xFF08;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x5F00;&#x53D1;&#x8005;&#x5404;&#x5F02;&#xFF09;&#x3001;CookieInjector&#xFF08;cookie&#x6CE8;&#x5165;&#x5DE5;&#x5177;&#xFF09;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x5FC5;&#x5907;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x4E0B;&#x8F7D;&#x7684;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5728;github&#x91CC;&#x641C;&#x3002;</p>
<h3 id="&#x4E0D;&#x8981;&#x8BB0;&#x5FC6;">&#x4E0D;&#x8981;&#x8BB0;&#x5FC6;</h3>
<p>&#x4E0D;&#x8981;&#x8BB0;&#x5FC6;&#x3002;&#x8FD9;&#x4E2A;&#x89C2;&#x70B9;&#x540C;&#x6837;&#x72ED;&#x9698;&#x3002;&#x4F46;&#x6211;&#x8BA4;&#x4E3A;&#x628A;JDK&#x6E90;&#x7801;&#x770B;&#x4E00;&#x904D;&#x8FD9;&#x79CD;&#x4E8B;&#x5927;&#x53EF;&#x4E0D;&#x5FC5;&#x53BB;&#x505A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x628A;JDK&#x88C5;&#x8F7D;&#x8111;&#x5B50;&#x91CC;&#x5360;&#x7528;&#x4E86;&#x592A;&#x591A;&quot;&#x786C;&#x76D8;&quot;&#x4E0D;&#x8BF4;&#xFF0C;&#x8FD8;&#x6D6A;&#x8D39;&#x4E86;&#x8FC7;&#x591A;&#x7CBE;&#x529B;&#x3002;&#x6211;&#x5EFA;&#x8BAE;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x7D22;&#x5F15;&#x3002;&#x8FD8;&#x8BB0;&#x7684;&#x7D22;&#x5F15;&#x7684;&#x5B9A;&#x4E49;&#x5417;&#xFF1F;&#x5B83;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x672C;&#x4E66;&#x7684;&#x76EE;&#x5F55;&#x3002;&#x6211;&#x901A;&#x5E38;&#x4F1A;&#x8BB0;&#x4E00;&#x904D;JDK&#x7684;API&#x5217;&#x8868;&#xFF0C;&#x77E5;&#x9053;&#x54EA;&#x4E2A;Function&#x5BF9;&#x5E94;&#x5728;&#x54EA;&#x4E2A;&#x5E93;&#x91CC;&#x3002;&#x5F53;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x53BB;&#x53D6;&#x5C31;&#x53EF;&#x4EE5;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x505A;&#x8FC7;&#x6570;&#x636E;&#x5E93;&#x7684;&#x90FD;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x7D22;&#x5F15;&#x7684;&#x610F;&#x4E49;&#x548C;&#x7528;&#x5904;&#x3002;
&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x8BB0;&#x4F4F;concurrent&#x5305;&#x662F;&#x7528;&#x6765;&#x5904;&#x7406;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x4F60;&#x8BB0;&#x4F4F;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x6709;nginx&#x3001;Apache&#xFF0C;&#x4F60;&#x8BB0;&#x4F4F;python&#x9002;&#x5408;&#x8BA1;&#x7B97;&#x3001;Java&#x5E93;&#x6BD4;&#x8F83;&#x591A;&#x3001;C++&#x9002;&#x5408;&#x539F;&#x751F;&#x3001;Zepto&#x9002;&#x5408;&#x79FB;&#x52A8;&#x7EC8;&#x7AEF;&#x3001;XML&#x6BD4;Json&#x5360;&#x7528;&#x66F4;&#x591A;&#x5B57;&#x8282;&#x3001;SVG&#x6BD4;PNG&#x66F4;&#x9002;&#x5408;&#x6BD4;&#x4F8B;&#x653E;&#x5927;&#x3001;&#x65E0;&#x8BBA;Mysql/Oracle/SQLite/Cubrid&#x90FD;&#x662F;ANSI SQL&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x7528;&#x4EC0;&#x4E48;&#x624D;&#x53BB;&#x53D6;&#x4EC0;&#x4E48;&#xFF0C;&#x65E0;&#x9700;&#x90FD;&#x8BB0;&#x5728;&#x8111;&#x5B50;&#x91CC;&#x3002;&#x53EA;&#x9700;&#x8BB0;&#x4F4F;&#xFF0C;&#x5728;&#x54EA;&#x91CC;&#x80FD;&#x627E;&#x5230;&#x7B54;&#x6848;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<h3 id="&#x5584;&#x4E8E;&#x8BB0;&#x5F55;">&#x5584;&#x4E8E;&#x8BB0;&#x5F55;</h3>
<p>&#x5373;&#x4F7F;&#x4F60;&#x7684;&#x601D;&#x7EF4;&#x518D;&#x6E05;&#x6670;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x3002;&#x6B63;&#x5982;&#x201C;&#x597D;&#x8BB0;&#x6027;&#x4E0D;&#x5982;&#x70C2;&#x7B14;&#x5934;&#x201D;&#x8FD9;&#x53E5;&#x4FD7;&#x8BED;&#x6240;&#x8BF4;&#x3002;&#x628A;&#x9700;&#x8981;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x624B;&#x5934;&#x505A;&#x4E86;&#x4E00;&#x534A;&#x7684;&#x5DE5;&#x4F5C;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x8FC5;&#x901F;&#x7684;&#x5207;&#x6362;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EF4;&#x5230;&#x751F;&#x6D3B;&#x72B6;&#x6001;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x7FFB;&#x5F00;&#x81EA;&#x5DF1;&#x7684;TODOs&#x4E5F;&#x53EF;&#x4EE5;&#x8FC5;&#x901F;&#x5207;&#x6362;&#x56DE;&#x5DE5;&#x4F5C;&#x72B6;&#x6001;&#x3002;&#x73B0;&#x5728;&#x624B;&#x673A;&#x7535;&#x8111;&#x90FD;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x8BB0;&#x4E8B;&#x672C;&#xFF0C;&#x50CF;Evernote&#x3001;&#x6709;&#x9053;&#x4E91;&#x7B14;&#x8BB0;&#x8FD9;&#x79CD;&#x6709;checkbox&#x3001;&#x5217;&#x8868;&#x7684;&#xFF0C;&#x5B8C;&#x6210;&#x4E00;&#x9879;&#x52FE;&#x4E00;&#x9879;&#x3002;
&#x535A;&#x5BA2;&#x3002;&#x8FD9;&#x79CD;&#x6700;&#x539F;&#x59CB;&#x5185;&#x5BB9;&#x8F7D;&#x4F53;&#xFF0C;&#x5F00;&#x653E;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x4E0D;&#x9650;&#x4E8E;&#x67D0;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x751F;&#x6001;&#x5708;&#x3002;&#x5728;&#x4F60;&#x8BB0;&#x5F55;&#x535A;&#x5BA2;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4F60;&#x91CD;&#x65B0;&#x5BA1;&#x89C6;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x4E14;&#x4E3A;&#x4E86;&#x590D;&#x8FF0;&#x6E05;&#x695A;&#xFF0C;&#x4F60;&#x4F1A;&#x66F4;&#x52A0;&#x8C28;&#x614E;&#x7684;&#x601D;&#x8003;&#x6280;&#x672F;&#x903B;&#x8F91;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5047;&#x5982;&#x4F60;&#x9677;&#x5165;&#x4E86;&#x67D0;&#x4E9B;&#x601D;&#x7EF4;&#x8BEF;&#x533A;&#xFF0C;&#x4F1A;&#x6709;&#x70ED;&#x5FC3;&#x7684;&#x670B;&#x53CB;&#x5E2E;&#x4F60;&#x6307;&#x51FA;&#xFF0C;&#x5171;&#x540C;&#x8FDB;&#x6B65;&#x3002;</p>
<h3 id="&#x8BBE;&#x7F6E;&#x95F9;&#x949F;">&#x8BBE;&#x7F6E;&#x95F9;&#x949F;</h3>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x662F;&#x4E13;&#x6CE8;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x751F;&#x6027;&#x4E0D;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x4E5F;&#x4F1A;&#x5728;&#x957F;&#x671F;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x4E2D;&#x6E10;&#x6E10;&#x53D8;&#x5F97;&#x4E13;&#x6CE8;&#x3001;&#x8C28;&#x614E;&#x3001;&#x6CE8;&#x610F;&#x7EC6;&#x8282;&#x3001;&#x903B;&#x8F91;&#x6E05;&#x6670;&#x3002;&#x4F46;&#x662F;&#x6B63;&#x56E0;&#x4E3A;&#x8FD9;&#x4EFD;&#x4E13;&#x6CE8;&#x4F60;&#x53EF;&#x80FD;&#x9677;&#x5165;&#x601D;&#x7EF4;&#x7684;&#x6B7B;&#x5FAA;&#x73AF;&#x4E2D;&#x3002;&#x5F53;&#x4F60;&#x4F4E;&#x5934;&#x4E13;&#x6CE8;&#x4E8E;&#x67D0;&#x9879;&#x6280;&#x672F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5916;&#x754C;&#x7684;&#x6280;&#x672F;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x5FEB;&#x901F;&#x7684;&#x8FED;&#x4EE3;&#x3001;&#x589E;&#x957F;&#x3001;&#x521B;&#x65B0;&#x3002;&#x6B63;&#x5F0F;&#x8FD9;&#x4EFD;&#x4E13;&#x6CE8;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4F60;&#x9519;&#x8FC7;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x4E00;&#x4E2A;bug&#x5D4C;&#x5957;&#x53E6;&#x5916;&#x4E00;&#x4E2A;bug&#xFF0C;&#x4F60;&#x6574;&#x5929;&#x90FD;&#x5728;&#x89E3;&#x51B3;bug&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x9677;&#x5165;&#x4E86;&#x9012;&#x5F52;&#x3001;for&#x3001;do...while&#x91CC;&#x9762;&#x53BB;&#x4E86;&#x3002;&#x4F60;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x89E6;&#x53D1;&#x5668;&#xFF08;trigger&#xFF1F;break&#xFF1F;whatever&#xFF09;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x8DF3;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x91CD;&#x65B0;&#x8BA4;&#x8BC6;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x8BF4;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x79CD;&#x601D;&#x7EF4;&#xFF0C;&#x8DF3;&#x51FA;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x4E5F;&#x8BB8;&#x2026;&#x2026;&#x4F60;&#x4F1A;&#x6709;&#x5973;&#x670B;&#x53CB;&#x7684;&#x3002;
&#x95F9;&#x949F;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x53EB;&#x9192;&#x4F60;&#x3002;&#x5F53;&#x4F60;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x653E;&#x4E0B;&#xFF0C;&#x6362;&#x4E2A;&#x89D2;&#x5EA6;&#xFF0C;&#x4E5F;&#x8BB8;&#x7528;10&#x5206;&#x949F;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F60;&#x94BB;&#x7814;&#x4E00;&#x4E2A;&#x665A;&#x4E0A;&#x3002;</p>
<h3 id="&#x5E7F;&#x4EA4;&#x670B;&#x53CB;">&#x5E7F;&#x4EA4;&#x670B;&#x53CB;</h3>
<p>&#x6280;&#x672F;&#x662F;&#x4E0D;&#x5206;&#x57CE;&#x5E02;&#x3001;&#x56FD;&#x754C;&#x7684;&#x3002;&#x6709;&#x65F6;&#x5019;&#x4E0E;&#x5176;&#x95ED;&#x95E8;&#x9020;&#x8F66;&#xFF0C;&#x4E0D;&#x5982;&#x7ED3;&#x4EA4;&#x4E00;&#x4E9B;&#x50CF;&#x5C24;&#x96E8;&#x6EAA;&#x3001;stormzhang&#x3001;justjavac&#x3001;Sean Larkin&#x3001;caiyongji&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x89C2;&#x70B9;&#x548C;&#x6280;&#x672F;&#x5206;&#x4EAB;&#x662F;&#x5F15;&#x9886;&#x56FD;&#x5185;&#x6280;&#x672F;&#x6F6E;&#x6D41;&#x7684;&#xFF08;&#x867D;&#x7136;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x6E23;&#xFF09;&#xFF0C;&#x548C;&#x4ED6;&#x4EEC;&#x63A2;&#x8BA8;&#x6280;&#x672F;&#x4E5F;&#x662F;&#x522B;&#x6709;&#x4E00;&#x756A;&#x4E50;&#x8DA3;&#x3002;&#x6211;&#x6709;&#x5E78;&#x6709;&#x4E0A;&#x9762;&#x5176;&#x4E2D;&#x51E0;&#x4F4D;&#x7684;&#x5FAE;&#x4FE1;&#xFF0C;&#x6BD4;&#x5982;caiyongji&#x7684;&#x5FAE;&#x4FE1;&#x662F;takeurhand&#x3002;
&#x5F53;&#x4F60;&#x9047;&#x5230;&#x6280;&#x672F;&#x96BE;&#x70B9;&#x9700;&#x8981;&#x653B;&#x514B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x725B;&#x4EBA;&#x4EEC;&#x5DF2;&#x7ECF;&#x9047;&#x5230;&#x4E86;&#xFF0C;&#x4E0E;&#x5176;&#x4E0A;&#x7F51;&#x641C;&#x7D22;&#xFF0C;&#x4E0D;&#x5982;&#x76F4;&#x63A5;&#x548C;&#x725B;&#x4EBA;&#x4EEC;&#x63A2;&#x8BA8;&#x3002;</p>
<h3 id="&#x5584;&#x7528;&#x53E3;&#x8BC0;">&#x5584;&#x7528;&#x53E3;&#x8BC0;</h3>
<p>&#x53E3;&#x8BC0;&#x662F;&#x9700;&#x8981;&#x8BB0;&#x5FC6;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6BD4;&#x5982;&#x5FEB;&#x6377;&#x952E;&#x3001;JVM&#x4F18;&#x5316;&#x65B9;&#x6CD5;&#x3001;SQL&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x3001;&#x6570;&#x636E;&#x5E93;&#x5206;&#x5E93;&#x5206;&#x8868;&#x6280;&#x5DE7;&#x3001;&#x9501;&#x7684;&#x539F;&#x7406;&#x3001;&#x5185;&#x5B58;&#x7ED3;&#x6784;&#x3002;&#x8FD9;&#x4E9B;&#x662F;IT&#x754C;&#x7684;&#x5143;&#x7D20;&#x5468;&#x671F;&#x8868;&#x3002;</p>
<h3 id="&#x653E;&#x5F03;&#x5B8C;&#x7F8E;">&#x653E;&#x5F03;&#x5B8C;&#x7F8E;</h3>
<p>String&#x548C;StringBuffer&#x7684;&#x533A;&#x522B;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x5927;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x5728;&#x5927;&#x91CF;&#x91CD;&#x590D;&#x7684;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#x4E2D;&#xFF0C;&#x4E0D;&#x8981;&#x5728;&#x4E4E;&#x90A3;&#x70B9;&#x5185;&#x5B58;&#x6D6A;&#x8D39;&#x3002;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x6210;&#x679C;&#x4F1A;&#x5728;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#x4E2D;&#x89E3;&#x51B3;&#x3002;&#x4E5F;&#x8BB8;&#x4F60;&#x8FC7;&#x5EA6;&#x4F18;&#x5316;&#x7684;&#x65F6;&#x95F4;&#x6210;&#x672C;&#x8DB3;&#x591F;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x52A0;&#x4E00;&#x6761;&#x5185;&#x5B58;&#x4E86;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="08.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 常见十种设计模式">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"提升效率的技巧","level":"1.2","depth":1,"next":{"title":"问题记录","level":"1.3","depth":1,"ref":"","articles":[{"title":"webview问题1","level":"1.3.1","depth":2,"path":"09.md","ref":"09.md","articles":[]},{"title":"git路径问题","level":"1.3.2","depth":2,"path":"10.md","ref":"10.md","articles":[]},{"title":"Can not perform this action after onSaveInstanceState","level":"1.3.3","depth":2,"path":"14.md","ref":"14.md","articles":[]}]},"previous":{"title":"常见十种设计模式","level":"1.1.8","depth":2,"path":"08.md","ref":"08.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"99.md","mtime":"2019-03-20T07:36:34.126Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-23T15:29:47.289Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

